# Code Samples From Large Group

In [1]:
import pandas as pd

In [6]:
cars = {
    "make" : [ "tesla", "ford", "chevy"],
    "model" : [ "model y", "f150", "trax"],
    "msrp" : [ 50000, 35000, 25000]
}
carsdf = pd.DataFrame(cars)
carsdf

    make    model   msrp
0  tesla  model y  50000
1   ford     f150  35000
2  chevy     trax  25000

In [10]:
# just get a series
carsdf["make"]

'tesla'

In [13]:
#just select columns from dataframe
y = carsdf[ ["make", "msrp"] ]
y

    make   msrp
0  tesla  50000
1   ford  35000
2  chevy  25000

In [15]:
# return a series with boolean expression appled
carsdf[ carsdf["msrp"] > 30000 ]

    make    model   msrp
0  tesla  model y  50000
1   ford     f150  35000

In [16]:
carsdf["msrp"] > 30000

0     True
1     True
2    False
Name: msrp, dtype: bool

In [18]:
carsdf

    make    model   msrp
0  tesla  model y  50000
1   ford     f150  35000
2  chevy     trax  25000

In [22]:
# rowslice
carsdf[0:2]

    make    model   msrp
0  tesla  model y  50000
1   ford     f150  35000

In [24]:
# use iloc for row/column slice
carsdf.iloc[:,1:3]

     model   msrp
0  model y  50000
1     f150  35000
2     trax  25000

In [26]:
carsdf[ 
    carsdf["msrp"]> 40000
    ][
    ["make","model"]
]

    make    model
0  tesla  model y